app/views/home/index.html.erb

            	<%if @user.tasks%>
            		<%@user.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 2]]