app/controllers/home_controller.rb

  def index
    @user = User.find(current_user.id)
    @user.points = 30
    @user.save
    default = Avatar.where(name: "0", user_id: current_user.id)
    if default.count == 0
      Avatar.create(name: "0", user_id: current_user.id)
    end
    @task = Task.new()
    if @user.item_id != -1
      @item = Item.find(@user.item_id)
    end
    if @user.tpoints and @user.points >= @user.tpoints and @item and @user.level == (@item.cost / 100 - 1)
      @user.level += 1
      @user.tpoints = 0
      @user.save
      Avatar.create(name: @user.level, user_id: current_user.id)
    end
    @avatars = Avatar.where(user_id: current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "level" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["level", 0], ["updated_at", "2018-04-19 09:31:01.674481"], ["id", 1]]
SELECT COUNT(*) FROM "avatars" WHERE "avatars"."name" = ? AND "avatars"."user_id" = ?  [["name", "0"], ["user_id", 2]]
INSERT INTO "avatars" ("created_at", "updated_at", "user_id", "name") VALUES (?, ?, ?, ?)  [["created_at", "2018-04-26 03:49:25.602005"], ["updated_at", "2018-04-26 03:49:25.602005"], ["user_id", 2], ["name", "0"]]
SELECT "avatars".* FROM "avatars" WHERE "avatars"."user_id" = ?  [["user_id", 2]]