app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "value", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["description", "laundry"], ["value", 10], ["created_at", "2018-04-22 02:14:51.176718"], ["updated_at", "2018-04-22 02:14:51.176718"], ["user_id", 2]]
---
		task = Task.create(description: params["task"]["description"], value: params["task"]["value"], user_id: current_user.id)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "points" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["points", 10], ["updated_at", "2018-04-26 07:43:52.248128"], ["id", 2]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 3]]
---
		task = Task.find(params[:id])
		@user = User.find(current_user.id)
		@user.points += task.value
		@user.save
		task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
		task = Task.find(params[:id])
		task.destroy